app/controllers/outpost_controller.rb

SELECT "outposts".* FROM "outposts" ORDER BY "outposts"."created_at" ASC
---
  def out
    @outs = Outpost.all.order(created_at: :asc)

SELECT  "outposts".* FROM "outposts" WHERE "outposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @out = Outpost.find_by(id: params[:id])

INSERT INTO "outposts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "ゲスト"], ["created_at", "2022-02-23 01:46:24.932399"], ["updated_at", "2022-02-23 01:46:24.932399"]]
---
  def create
    @out = Outpost.new(content: params[:content])
    if @out.save

SELECT  "outposts".* FROM "outposts" WHERE "outposts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "outposts" WHERE "outposts"."id" = ?  [["id", 8]]
---
  def destroy
    @out = Outpost.find_by(id: params[:id])
    @out.destroy