app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "管理者"], ["email", "2022"], ["created_at", "2022-02-22 07:03:42.186923"], ["updated_at", "2022-02-22 07:03:42.186923"], ["password", "swan2"]]
---
  def create
    @user = User.new(name: params[:name], email: params[:email], password: params[:password])
    if @user.save